Repository: XFox111/GUTSchedule
Catalog: GUT.Schedule/GUTSchedule.UWP/Strings/*/Resources.resw
Source language: en
Languages: ru

# aboutOption.Label
source: About application
ru: О приложении

# aboutTitle.Text
source: About application
ru: О приложении

# addGroupToTitle.Content
source: Add group number to event title
ru: Добавить номер группы в заголовок

# addScheduleButton.Content
source: Add schedule
ru: Добавить расписание

# appDescription.Text
source: Application for SPbSUT professors' and students' schedule export
ru: Приложение для экспорта перподавательского и учебного расписаний Санкт-Петербургского Государственного Университета Телекоммуникаций им. проф. М.А. Бонч-Бруевича

# appDisplayDescription
source: Application which exports SPbSUT timetable to calendar
ru: Приложение для экспорта расписания СПбГУТ в календарь

# appDisplayName
source: GUT.Schedule
ru: ГУТ.Расписание

# appName.Text
source: GUT.Schedule
ru: ГУТ.Расписание

# authorizeCheckbox.Content
source: Authorize via Personal cabinet
ru: Авторизоваться через Личный кабинет

# calendarExportStatus
source: Exporting to calendar
ru: Экспортирование в календарь

# cancelOption
source: Cancel
ru: Отмена

# clearAllOption
source: All
ru: Все

# clearCalendarOption.Label
source: Clear schedule
ru: Очистить расписание

# clearScheduleDone
source: Schedule is cleared
ru: Расписание очищено

# clearScheduleMessage
source: This action will purge exported schedule from all available calendars. It will affect only events created by the app. 'All' - will purge all timetable events including the past ones 'Upcoming' - will affect only upcoming timetable events
ru: Это действие удалит экспортированное расписание из всех доступных календарей. Данное действие затронет только расписание, экспортированное этим приложением 'Все' - удалит все события расписания, включая прошедшие 'Только новые' - удалит будущие события расписания

# clearScheduleTitle.PrimaryButtonText
source: Clear schedule
ru: Очистить расписание

# clearScheduleTitle.SecondaryButtonText
source: Cancel
ru: Отмена

# clearScheduleTitle.Title
source: Clear schedule
ru: Очистка расписания

# clearUpcoming.Content
source: Remove only upcoming events
ru: Удалить только будущие события

# clearUpcomingOption
source: Upcoming
ru: Только новые

# connectionFailMessage
source: Unable to load schedule. Check your internet connection or try again later
ru: Невозможно загрузить расписание. Проверьте интернет-соединение или попробуйте позже

# contactsTitle.Text
source: Contacts
ru: Контакты

# contributorsTitle.Text
source: Contributors
ru: Свой вклад в разработку внесли

# copyrights.Text
source: ©2020 Michael Gordeev, INS, ICT-907
ru: ©2020 Михаил Гордеев, ИСиТ, ИСТ-942

# courseSpinner.Header
source: Course
ru: Курс

# createCalendarMessage
source: There's no calendars on your device we can write schedule to
ru: На вашем устройстве нет календарей пригодных для записи расписания

# createCalendarTitle
source: Create new calendar
ru: Создайте новый календарь

# dateRangeFrom.Header
source: Export from
ru: Брать расписание с

# dateRangeTo.Header
source: Export to
ru: По

# destinationCalendar.Header
source: Destination calendar
ru: Конечный календарь

# developedBy.Text
source: Developed by Michael Gordeev (ICT-907, INS) in the "Technologies of Informational and Educational Systems" Research Facility
ru: Разработано Михаилом Гордеевым, ИСТ-942, ИСиТ в Научно-образовательном центре "Технологии информационных образовательных систем"

# doneStatus
source: Done
ru: Готово

# exportParametersTitle.Text
source: Export parameters
ru: Параметры экспорта

# facultySpinner.Header
source: Faculty
ru: Факультет

# facultySpinner.PlaceholderText
source: No schedule is available
ru: Нет доступного расписания

# fiveMinuteReminder.Content
source: 5 minutes
ru: 5 минут

# forDay.Content
source: For day
ru: На день

# forMonth.Content
source: For month
ru: На месяц

# forSemester.Content
source: For semester
ru: На семестр

# forWeek.Content
source: For week
ru: На неделю

# groupSelectionError
source: Error: no group was selected
ru: Ошибка: Не выбрана группа

# groupSpinner.Header
source: Group
ru: Группа

# groupSpinner.PlaceholderText
source: No schedule is available
ru: Нет доступного расписания

# inTimeReminder.Content
source: At the start of event
ru: Во время начала

# invalidAuthorizationError
source: Error: Invalid credential
ru: Ошибка авторизации

# invalidDateRangeError
source: Error: Invalid date range
ru: Ошибка: Неправильный диапазон дат

# leaveFeedback.Content
source: Leave feedback
ru: Оставить отзыв

# linksTitle.Text
source: Useful links
ru: Полезные ссылки

# loadingStatus
source: Loading
ru: Загрузка

source: My schedule
ru: Мое расписание

# noReminder.Content
source: None
ru: Нет

# notsLink.Text
source: "TIES" RF
ru: НОЦ "ТИОС"

# password.PlaceholderText
source: Password
ru: Пароль

# privacyPolicyLink.Text
source: Privacy policy
ru: Политика конфиденциальности

# remember.Content
source: Remember
ru: Запомнить

# reminderSpinner.Header
source: Set reminder for:
ru: Напоминать за

# repeat
source: Try again
ru: Повторить

# reportErrorOption.Label
source: Report error
ru: Сообщить об ошибке

# repositoryLink.Text
source: GitHub Repository
ru: Репозиторий GitHub

# scheduleParametersTitle.Text
source: Schedule parameters
ru: Параметры расписания

# specialThanksPeople.Text
source: Vitaliy Moshkov, Anastasiya Godunova
ru: Виталий Мошков, Анастасия Годунова

# specialThanksTitle.Text
source: Special thanks
ru: Особые благодарности

# sutLink.Text
source: SPbSUT
ru: СПбГУТ

# tenMinuteReminder.Content
source: 10 minutes
ru: 10 минут

# titleNote.Text
source: (i) This doesn't affect professors' schedule
ru: (i) Не касается преподавательского расписания

# today.Content
source: Today
ru: Сегодня

# twitterContact.Text
source: Twitter
ru: Твиттер

# vkontakteContact.Text
source: VKontakte
ru: ВКонтакте

# websiteContact.Text
source: Website
ru: Веб-сайт
